In [5]:
#IMPRTING PANDAS AS pd AND NUMPY AS np
import pandas as pd
import numpy as np
from datetime import datetime

In [6]:
#1. The Used Car Price Estimator

In [7]:
#Handling years and usage intensity.

In [8]:
# 1. Create Raw Data
car_data = {
    'Brand': ['Toyota', 'BMW', 'Ford', 'Tesla', 'Audi'],
    'Year': [2015, 2022, 2018, 2021, 2010],
    'Mileage': [85000, 15000, 45000, 22000, 150000],
    'Price_USD': [12000, 45000, 18000, 55000, 7000]
}
cars = pd.DataFrame(car_data)

In [10]:
cars

    Brand  Year  Mileage  Price_USD
0  Toyota  2015    85000      12000
1     BMW  2022    15000      45000
2    Ford  2018    45000      18000
3   Tesla  2021    22000      55000
4    Audi  2010   150000       7000

In [11]:
# 2. Feature Engineering
current_year = 2026
cars['Car_Age'] = current_year - cars['Year']

In [12]:
cars

    Brand  Year  Mileage  Price_USD  Car_Age
0  Toyota  2015    85000      12000       11
1     BMW  2022    15000      45000        4
2    Ford  2018    45000      18000        8
3   Tesla  2021    22000      55000        5
4    Audi  2010   150000       7000       16

In [13]:
# Usage Intensity: Miles driven per year
# We add 1 to Age to avoid division by zero for brand new cars
cars['Miles_Per_Year'] = cars['Mileage'] / (cars['Car_Age'] + 1)

In [14]:
cars

    Brand  Year  Mileage  Price_USD  Car_Age  Miles_Per_Year
0  Toyota  2015    85000      12000       11     7083.333333
1     BMW  2022    15000      45000        4     3000.000000
2    Ford  2018    45000      18000        8     5000.000000
3   Tesla  2021    22000      55000        5     3666.666667
4    Audi  2010   150000       7000       16     8823.529412

In [15]:
# Luxury Flag
luxury_brands = ['BMW', 'Tesla', 'Audi', 'Mercedes', 'Lexus']
cars['Is_Luxury'] = cars['Brand'].isin(luxury_brands).astype(int)

In [16]:
cars

    Brand  Year  Mileage  Price_USD  Car_Age  Miles_Per_Year  Is_Luxury
0  Toyota  2015    85000      12000       11     7083.333333          0
1     BMW  2022    15000      45000        4     3000.000000          1
2    Ford  2018    45000      18000        8     5000.000000          0
3   Tesla  2021    22000      55000        5     3666.666667          1
4    Audi  2010   150000       7000       16     8823.529412          1